{
  "testimonials": [
    {
      "text": "I saw Dr. Nick for my intake and I've spoken with Dr. Rachel on a few occasions. They are great and the intake is very in depth. They have a beautiful space that is very serene. They focus on functional correction and they have some really cool technology that can assess if you're staying in fight or flight mode or rest and digest with a heart rate variability monitor. They take a thorough amount of time to assess your posture and then through a machine they will show you where you need their expertise through their EMG machine. One of my most favorite things they offer is an infrared sauna!  I recommend to check them out as they offered me insight into my health I was not aware of before!",
      "author": "Pete"
    },
    {
      "text": "Dr Nick and Dr Rachel are not average chiropractors. They are miracle workers and life savers who truly care for their patients.  They take the time to truly listen what is going on with you mentally and physically. If you are looking for an out of this world chiropractic experience with amazing heart-centered doctors, look no farther than Realm Chiropractic.  If I could give them 10 stars, I would.",
      "author": "Cheryl D"
    },
    {
      "text": "Dr. Nick and Dr. Rachel are magic!!  They squeezed me in last minute because my bulging disc at L5/S1 was super fired up.  😳 I had been at a 10 of 10 pain level for the weekend. The care and concern is phenomenal. Knowledgeable and professional. I am so thankful for Realm!!  Highly recommend!! …",
      "author": "Terri W"
    },
    {
      "text": "Had a great experience with Dr. Rachel & Dr. Nick at Realm Chiropractic. When I'm back in the area, I will for sure visit again!",
      "author": "Eddie P"
    },
    {
      "text": "I have been seeing Dr. Rachel and Dr. Nick since 2017. Their approach is comprehensive in that it provides a period of more frequent adjustments till your body gets to a place that only maintenance adjustments are needed. Additionally, I have worked closely with Dr. Rachel on figuring out the best supplements to help me. However, the best part is working with them consistently and following the protocol of visits to improve your body is that you truly become a part of the Realm family. Along with providing excellent chiropractic treatment and nutritional advise. Dr. Rachel has worked with me through Yoga, really figuring out what things work best for always improving upon it and constant support for stress and anxiety. I cannot recommend anymore more strongly than Dr. Rachel and Dr. Nick. Their positivity and constant support through health issues and advice when you truly apply it life changing! So grateful to have found a team that truly looks out for me.",
      "author": "Brian S"
    },
    {
      "text": "Drs. Nick & Rachel are the most caring and intuitive chiropractors I have ever been to and I've seen a lot over my 62 years of life.  Firstly, they are very thorough in their initial assessment of your body and life as a whole.  Be sure they are thinking of your mind, body and spirit as they lay their gifted hands on you.  I have found it best in my life, as an older athlete, to get consistent care and keep tuned up rather than waiting until I have an acute event to go in.  You deserve the best chiropractic care for your body and you will get it at Realm Chiropractic!",
      "author": "Linda R"
    },
    {
      "text": "Allergies I have had most of my life have been greatly alleviated",
      "author": "S.S."
    },
    {
      "text": "The easy manner in which the worked with and connected with my children is very noticable",
      "author": "T.D."
    },
    {
      "text": "They make sure the body is doing good.  Them adjusting me, is one of the best things that I have ever experienced. They make life funner",
      "author": "M.S. age 7"
    },
    {
      "text": "Dr.Nick and Dr.Rachel have taken our entire family from so-so to exceptional",
      "author": "L.H"
    },
    {
      "text": "Perfect care for the entire family. I don't know where we would be without them",
      "author": "K.L."
    },
    {
      "text": "They adjust our bodies and we feel better. It is cool to get adjusted. It doesn't take long and I feel much better.",
      "author": "C.Z age 10"
    },
    {
      "text": "My son suffers from frequent colds and ear infections and teh colds drastically decreased and not one ear infection this winter",
      "author": "M.L."
    },
    {
      "text": "My family had been adjusted for a year now, and we've definitely noticed a change.  We are not getting as sick as most of our friends",
      "author": ""
    },
    {
      "text": "My family has been getting adjusted regularly by Dr. Nick and Dr. Rachel for almost 2 years. When I say \"my family\" I mean all of us from the 2 newborns adjusted at birth to the \"Grammy\" ",
      "author": "B.S."
    },
    {
      "text": "Dr. Nick and Dr. Rachel have created an incredible atmosphere with their practice. They are not a simple \"crack and pop\" chiropractor, but that’s a good thing! Their approach is truly personalized, and their treatment plans are tailored to address the root cause of their patients’ symptoms",
      "author": "A.K."
    },
    {
      "text": "Dr. Nick and Dr. Rachel are the first people we seek at the on-set of pain, injury, or common symptoms.  I am continually recommending their services to my family and friends because I truly believe that I could not do without their care. I want the same for others that I love.",
      "author": "L.H."
    },
    {
      "text": "Nick is not your stereotypical chiropractor. He's a pro who won't sell you something that you don't need or that isn't in your budget. He knows the latest and greatest techniques and is up to date on his research, but he also backs his treatments with sound medicine. Can't recommend these guys enough.",
      "author": "C.J."
    },
    {
      "text": "Dr. Nick and Dr. Rachel are two of the most wonderful human beings I have ever encountered. Their level of care for their patients is simply unrivaled. From their technical knowledge and practice in the discipline of chiropractic care, to their genuine desire to help others, they are the best in the business.",
      "author": "S.B."
    },
    {
      "text": "As a busy entrepreneur, I also really appreciate their flexible time block scheduling. It has allowed me to keep every appointment I made by. giving me options to come in and get adjusted",
      "author": ""
    },
    {
      "text": "Dr. Nick and Dr. Rachel also specialize in helping children, and pregnant mothers, adapt better, and feel their best. I can't say enough great things about them both.",
      "author": "S.B."
    },
    {
      "text": "What a great practice right close to work and home! Thank you for being so informative, professional, helpful, caring, resourceful, friendly, and kind. I highly recommend for anyone to visit to improve their quality of life.",
      "author": "E.H."
    },
    {
      "text": "I went to see Nick and Rachel for sleep and overall fatigue issues and now I sleep through the night again!! You guys ROCK!",
      "author": "T.S."
    },
    {
      "text": "Dr. Nick and Dr. Rachel care about who you are at the core level and have helped me FEEL better all the way around.",
      "author": "J.T."
    },
    {
      "text": "Nick and Rachel have changed my quality of life exponentially for the better. I have had some health issues for the last few years that no doctor has been able to figure out what is going on. This caused a lot of stress on my life and caused me to start feeling overwhelmed, anxious, a little depressed and just unhappy. Through chiropractic adjustments and nutrition recommendations, I have started to not only get back to my outdoor activities but feel happier daily, function normally, and enjoy life.",
      "author": ""
    },
    {
      "text": "They are the most understanding, caring, welcoming people and they will do what they can to help you get more balanced in the many realms that we deal with.",
      "author": "B.W."
    },
    {
      "text": "Since being under care with Nick and Rachel, they have completely changed my life physically, mentally, and spiritually. They have supported me through body pains and aches, emotional events, pregnancy, and so much more. Consistently receiving care from them led me to an amazing, pain free, natural birth and a happy healthy family.",
      "author": "M.N."
    },
    {
      "text": "I cannot say enough how thankful I am for their love, education, and exceptional chiropractic care.",
      "author": ""
    },
    {
      "text": "The depth of knowledge both of these doctors share about chiropractic and wellness is extraordinary.",
      "author": ""
    },
    {
      "text": "I have worked with Nick and Rachel for 5 years. Their level of care for myself and my family has created a high level of trust. As a massage therapist with a holistic view, I have referred any of my clients that need chiropractic care directly to Realm.",
      "author": "C.F."
    },
    {
      "text": "A great practice you can trust to take utmost care of your babies sensitive needs.",
      "author": "V.V."
    }
  ]
}
